{
  "Header": {
    "logo": "Nadir.B",
    "nav": [
      {
        "name": "Home",
        "link": "#home"
      },
      {
        "name": "Skills",
        "link": "#skills"
      },
      {
        "name": "About",
        "link": "#about"
      },
      {
        "name": "Projects",
        "link": "#projects"
      },
      {
        "name": "Contact",
        "link": "#contact"
      }
    ],
    "resume": {
      "name": "Resume",
      "link": "#resume"
    }
  },

  "HeroSection": {
    "wellcom": "Hello, I'm",
    "name": "Nadir Bakhsh",
    "role": "Fullstack Developer",
    "catchy": "Open to Work",
    "description": "Hi, I’m Nadir Bakhsh, a passionate Fullstack development and specializing in Frontend development with responsive design, and user-friendly web and Apps. With a strong background in React, Remix, Next.js, Tailwind CSS and modern JavaScript libraries, please feel free to connect with me and discuss your project."
  },

  "SocialMediaLinks": [
    {
      "title": "Github",
      "icon": "Github",
      "url": "https://github.com/NadirBakhsh"
    },
    {
      "title": "Linkedin",
      "icon": "LinkedIn",
      "url": "https://www.linkedin.com/in/nadir-bakhsh-39807413a/"
    },
    {
      "title": "Instagram",
      "icon": "Instagram",
      "url": "https://www.instagram.com/nadir_bakhsh_1/"
    },
    {
      "title": "Facebook",
      "icon": "Facebook",
      "url": "https://www.facebook.com/nadir.bakhsh"
    },
    {
      "title": "Tweeter - X",
      "icon": "XLogo",
      "url": "https://twitter.com/NadirBatti"
    }
  ],

  "SkillSection": {
    "title": "Skills",
    "skills": [
      {
        "name": "Javascript",
        "icon": "Javascript"
      },
      {
        "name": "TypeScript",
        "icon": "Typescript"
      },
      {
        "name": "React",
        "icon": "React"
      },
      {
        "name": "Next.js",
        "icon": "Next"
      },
      {
        "name": "Remix",
        "icon": "Remix"
      },
      {
        "name": "Tailwind CSS",
        "icon": "Tailwindcss"
      },
      {
        "name": "Redux",
        "icon": "Redux"
      },
      {
        "name": "Storybook",
        "icon": "Storybook"
      },
      {
        "name": "Node JS",
        "icon": "Node"
      },
      {
        "name": "Express",
        "icon": "Express"
      },
      {
        "name": "Nest.js",
        "icon": "Nest"
      },
      {
        "name": "Mongo DB",
        "icon": "Mongodb"
      },
      {
        "name": "Database",
        "icon": "Database"
      },
      {
        "name": "Web Services",
        "icon": "Aws"
      },
      {
        "name": "Git",
        "icon": "Git"
      }
    ]
  },

  "ExperienceSection": {
    "title": "Experience",
    "experiences": [
      {
        "company": "Now Posh - IT Department",
        "type": "Full Time",
        "country": "Pakistan",
        "role": "Senior Software Engineer",
        "duration": "Jan 2024 - Present",
        "describe": "At Now Posh, I worked as a Full Stack Developer and Team Lead, overseeing both frontend and backend development. I led a team of developers, maintained code quality, and optimized workflows for efficient project execution. My role involved building scalable web applications, implementing secure authentication, and integrating RESTful APIs for smooth data exchange. Leveraging React.js, Next.js, and Node.js, I developed high-performance, user-friendly interfaces. Additionally, I conducted code reviews and mentorship sessions, fostering a strong development culture. My contributions enhanced project efficiency, improved application reliability, and accelerated delivery timelines",
        "logoUrl": "./companies-logo/posh_logo.png"
      },
      {
        "company": "Designocracy",
        "type": "Full Time",
        "country": "Pakistan",
        "role": "Full Stack Engineer",
        "duration": "Jan 2021 - Nov 2024",
        "describe": "At Designocracy, I began as a Frontend UI Developer, focusing on creating responsive and user-friendly interfaces while integrating APIs to enhance functionality. My expertise in React.js, Next.js, and modern UI frameworks contributed to streamlined development and improved user experience. Recognizing my contributions, I was promoted to Full Stack Engineer, where I collaborated with backend teams to design REST API data schemas and integrate them into the frontend. Over time, I played a key role in optimizing performance, ensuring scalability, and maintaining high code standards. Later, I advanced to a Part-Time Full Stack Engineer, continuing to build scalable web solutions while mentoring junior developers and conducting code reviews to enhance overall project quality.",
        "logoUrl": "./companies-logo/designocracy_logo.jpg"
      },
      {
        "company": "Upwork",
        "type": "Remote - Part Time",
        "country": "Pakistan",
        "role": "Frontend Engineer",
        "duration": "Jan 2019 - Present",
        "describe": " work as a part-time freelancer on Upwork, specializing in frontend development with a strong focus on React.js, Next.js, and modern UI frameworks. I have successfully delivered multiple projects with top ratings, ensuring high-quality, scalable, and user-friendly applications. My expertise includes crafting responsive interfaces, optimizing performance, and implementing secure API integrations for seamless user experiences. By following best coding practices, I ensure clean, maintainable, and efficient code. I also contribute to development workflows through code reviews and mentorship. My dedication to client satisfaction and attention to detail help me deliver reliable and high-performing solutions.",
        "logoUrl": "./companies-logo/upwork_logo.jpg"
      },
      {
        "company": "Pikky",
        "country": "USA",
        "type": "Full Time",
        "role": "Frontend Engineer",
        "duration": "Jan 2023 - Nov 2024",
        "describe": "For Pikky, I developed both the Restaurant Dashboard and the Mobile Application, ensuring a seamless experience for restaurant owners and customers. The Restaurant Dashboard was built using React.js, providing intuitive order management, analytics, and real-time updates. The Mobile App, developed with React Native, offered a user-friendly interface for placing orders, tracking deliveries, and making secure payments. I implemented authentication and API integrations, ensuring data security and smooth communication between the frontend and backend. Leading code reviews, I maintained high coding standards and optimized performance. Additionally, I mentored junior developers, improving team efficiency and overall project quality.",
        "logoUrl": "./companies-logo/pikky_logo.jpg"
      },
      {
        "company": "Expertizo",
        "type": "Full Time",
        "country": "Pakistan",
        "role": "Full-stack Developer",
        "duration": "Feb 2020 - Jan 2021",
        "describe": "I developed and maintained scalable React applications, ensuring high performance and efficiency. My role involved implementing robust authentication mechanisms to enhance security. I integrated various APIs seamlessly, optimizing data flow and user experience. Leading code reviews, I provided constructive feedback to improve code quality. I also mentored junior developers, fostering a culture of continuous learning. These efforts streamlined development workflows and boosted overall team productivity.",
        "logoUrl": "./companies-logo/expertizo_logo.jpg"
      }
    ]
  },

  "AboutSection": {
    "title": "About",
    "bio": [
      {
        "title": "Who I Am",
        "describe": "Nadir Bakhsh, I am a dedicated full-stack developer with more than 7 years of expertise in creating modern web and mobile applications. I focused to developing efficient, scalable, and user-friendly Web & APP, particularly use technologies for frontend like React, Next.js, Remix, and React Native. My passion to create smooth digital experiences for Business who want growth in the world."
      },
      {
        "title": "What I Do",
        "describe": " crafting high quality of web & APPs using JavaScript frameworks such as Next.js and React, along with backend solutions powered by Node.js and Nest.js. My skills also include working with databases like MongoDB, MySQL, PostgreSQL and Firebase. This ensures the solutions I develop are both resilient and scalable. Additionally, I have a strong proficiency in UI/UX design, utilizing frameworks like Tailwind CSS, Material-UI, and Ant Design to create interfaces."
      },
      {
        "title": "My Education and Experience",
        "describe": "completed high school education at Ataturk Public School and intermediate studies at Superior Science College. further enhanced my technical skills by  IT Diploma from SMIT, where I excelled with a top 10 result, reflecting my strong dedication to learning in the field of technology."
      },
      {
        "title": "Achievements and Aspirations",
        "describe": "I have received three time “Best Employee of the Month” awards at Designocracy, and At Posh I was promoted to Team Lead just two months after joining. My portfolio showcases successful projects like Mahaba, Aldi US Dashboard, and Pikky.io. In the future, My aim to continue advancing the fields of web and mobile development, adopting upcoming technologies, and providing outstanding digital solutions."
      }
    ]
  },

  "ProjectsInfo": {
    "title": "Projects",
    "projects": [
      {
        "name": "Pikky AI – Food Assistant",
        "describe": "Pikky is an AI-driven platform designed to enhance the dining experience by connecting restaurants with their guests on a deeper level. It offers personalized food recommendations to diners while providing restaurants with actionable insights to optimize their offerings and operations.",
        "features": [
          "🍽 Discover Restaurants – Browse restaurants based on location, cuisine, and preferences.",
          "📍 Interactive Map – Find nearby restaurants with real-time navigation.",
          "🥗 Dish Selector – Choose dishes based on taste preferences and dietary restrictions.",
          "⚠ Allergy Awareness – Get alerts for potential allergens in menu items.",
          "🔍 Cuisine Explorer – Filter dishes by cuisine type and user ratings.",
          "📊 Nutritional Information – View detailed nutritional breakdown of meals.",
          "🛒 Restaurant Menu Screen – Check detailed menus before visiting.",
          "🛤 Navigation Assistance – Get step-by-step directions to your selected restaurant.",
          "📑 Detailed Dish View – See ingredients, reviews, and preparation details."
        ],
        "image":"./projects-mock-ups/Pikky-Mock-up/pikky-ai-food.png",
        "link":"https://pikky.io/" 
      },
      {
        "name": "NextThing",
        "describe": "Developed Merketing and investment platform. where connect investors with NextThing company. The platform provides a streamlined experience for investors to buy shares provide agreement.",
        "features": [
          "💻 Marketing dynamic Landing Pages",
          "📝 Register form",
          "🔒 Login Form",
          "👥 Investor Profiles",
          "📊 Investor Dashboard",
          "💸 Transtion tracking system",
          "📈 Buying shares",
          "📝 Agreements",
          "📊 Company Dashboard"
        ],
        "image":"./projects-mock-ups/Nextbolt-Mock-ups/nextthings.png",
        "link":"https://www.nextthing.tech/" 
      },
      {
        "name": "MeinProfilbild.de - AI-Powered Portfolio Generator",
        "describe": "MeinProfilbild.de is an online platform that uses advanced AI technology to transform your selfies into professional application photos. This service is ideal for individuals who need high-quality profile pictures for professional networks like LinkedIn or for job applications quickly and easily.",
        "features": [
          "📝 Register",
          "🔒 Login",
          "👤 Profile Set-up",
          "🖼️ Upload 4 to 5 Images",
          "🤖 Return AI-Powered Profile Picture",
          "📝 Dynamic Blogging System Created with Strapi",
          "🔍 Profile Image Viewer",
          "💻 Responsive User Experience",
          "🔍 SEO Friendly Website"
        ],
        "image":"./projects-mock-ups/meinprofilbild-mock-ups/Profile ai image.png",
        "link":"https://meinprofilbild.de/" 
      }
      
    ]
  },

  "Testimonials": {
    "title": "Testimonial",
    "reviews": [
      {
        "comment": "Great experience. Nadir did a perfect job, project came out better than we expected and he delivered ahead of schedule. I highly recommend this seller, he communicates very well and is professional. Works fast and delivers excellent work!",
        "username": "Client: 45599916",
        "user_image_url": "./asset/user-placeholder.png",
        "value": 5,
        "reviewer_country": "United States"
      },
      {
        "comment": "He is an expert programmer and create a wonderful custom website for me with full backend integration . It was a nice experience with him highly recommended!!! I will hair him in future as well. Thanks for everything!!",
        "username": "Manzar Ali",
        "user_image_url": "./asset/user-placeholder.png",
        "value": 5,
        "reviewer_country": "Pakistan"
      },
      {
        "comment": "He is an expert developer and develop my web application according to my requirements. Highly recommended!!",
        "user_image_url": "./asset/user-placeholder.png",
        "value": 5,
        "username": "Manzar Ali",
        "reviewer_country": "Pakistan"
      },
      {
        "comment": "Awesome developer, attention to details and very responsive.",
        "username": "Dean",
        "user_image_url": "./asset/user-placeholder.png",
        "reviewer_country_code": "CA",
        "value": 5,
        "reviewer_country": "Canada"
      },
      {
        "comment": "It was great enjoyed working with him, excellent communication with suggestions over all amazing experience....I'd recommend anyone.",
        "username": "Dean",
        "user_image_url": "./asset/user-placeholder.png",
        "reviewer_country_code": "CA",
        "value": 5,
        "reviewer_country": "Canada"
      },
      {
        "comment": "Very professional and delivery great recommanded developer",
        "username": "Mederouich",
        "user_image_url": "https://fiverr-res.cloudinary.com/image/upload/f_auto,q_auto,t_profile_small/v1/attachments/profile/photo/eef9cbf19009311bc6344dd7623cbe4a-1708613564812/7e3d98ec-4286-4a9b-be22-942fa5bed6ae.png",
        "value": 5,
        "reviewer_country": "Morocco"
      },
      {
        "comment": "Great developer, very nice experience with nadir , very professional, and do the job properly.",
        "username": "Mederouich",
        "user_image_url": "https://fiverr-res.cloudinary.com/image/upload/f_auto,q_auto,t_profile_small/v1/attachments/profile/photo/eef9cbf19009311bc6344dd7623cbe4a-1708613564812/7e3d98ec-4286-4a9b-be22-942fa5bed6ae.png",
        "value": 5,
        "reviewer_country": "Morocco"
      }
    ]
  },
  "ContactSection": {
    "title1": "Let’s talk Idea",
    "title2": "build Something special",
    "describe": "I seek to push the limits of creativity to create high-engaging, user-friendly, and memorable interactive experiences.",
    "name": "Nadir Bakhsh",
    "phone": "+92 3052013106"
  },
  "Footer": {}
}
